Revit 2027 API
BuiltInFailures.EditingFailures.CannotDuplicateType Property
 Cannot Duplicate Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDuplicateType { get; }
Public Shared ReadOnly Property CannotDuplicateType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDuplicateType {
	FailureDefinitionId^ get ();
}
static member CannotDuplicateType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace